Repository: yantrabuddhi/blocos
Catalog: translations/*.po
Languages: ca_es, es_es, pt_br

source: Installed GTK+ version is: %s
ca_es: Versió instal·lada de GTK+ : %s
es_es: Versión de GTK+ instalada : %s
pt_br: A versão instalada do GTK é: %s

source: Requested GTK+ version is: %s or better
ca_es: Versió necessària de GTK+ : %s o millor
es_es: Versión necesaria de GTK+ : %s o mejor
pt_br: Versão necessária do GTK+ é: %s ou melhor

source: <no title project>
ca_es: <projecte sense títol>
es_es: <proyecto sin título>
pt_br: <projeto sem título>

source: Code
ca_es: Codi
es_es: Código
pt_br: Código

source: Version
ca_es: Versió
es_es: Versión
pt_br: Versão

source: Tools
ca_es: Eines
es_es: Herramientas
pt_br: Ferramentas

source: There were a problem with the connection Verify if the gogoboard is properly connected with your computer
pt_br: Houve um problema com a conexão Verifique se a placa está corretamente conectada com o seu computador

source: Undefinied function or variable being used
pt_br: Função ou váriável indefinida sendo usada

source: Brackets error
ca_es: Error de corxets
es_es: Error de corchetes
pt_br: Erro de colchetes

source: Too long code block
pt_br: Código muito longo

source: Too long code
pt_br: Código muito grande

source: Too many variables being used
ca_es: Massa variables en ús
es_es: Demasiadas variables en uso
pt_br: Muitas variáveis sendo usadas

source: Multiple function/variable declaration
ca_es: Declaració múltiple de funció o variable
es_es: Declaración múltiple de función o variable
pt_br: Declaração múltipla de função ou variável

source: Parentheses error
ca_es: Error de parèntesi
es_es: Error de paréntesis
pt_br: Erro de parênteses

source: Compilation or communication error
ca_es: Error de compilació o comunicació
es_es: Error de compilación o comunicación
pt_br: Erro de compilação ou comunicação

source: Code successfully sent!
ca_es: Codi enviat amb èxit!!
es_es: Código enviado con èxito!!
pt_br: Código enviado com sucesso!

source: gogoBoard connection lost
pt_br: Conexão perdida com a placa

source: File %s will be overwritten, are you sure to proceed?
pt_br: Arquivo %s será sobrescrito, deseja continuar?

source: Save...
ca_es: Alça...
es_es: Guardar...
pt_br: Salvar...

source: Open...
ca_es: Obri...
es_es: Abrir...
pt_br: Abrir...

source: project
ca_es: projecte
es_es: proyecto
pt_br: projeto

source: Properties
ca_es: Propietats
es_es: Propiedades
pt_br: Propriedades

source: Choose the sensor:
ca_es: Escull sensor:
es_es: Escoger sensor:
pt_br: Escolha o sensor:

source: New variable:
ca_es: Nova variable:
es_es: Nueva variable:
pt_br: Nova variável

source: Choose an already existing variable:
ca_es: Escull una variable existent:
es_es: Escoger una variable existente:
pt_br: Escolher uma variável já existente:

source: _File
ca_es: _Fitxer
es_es: _Fichero
pt_br: _Arquivo

source: _Edit
ca_es: _Edita
es_es: _Edita
pt_br: _Editar

source: _See
pt_br: _Ver

source: _Help
ca_es: _Ajuda
es_es: _Ayuda
pt_br: _Ajuda

source: Control
pt_br: Controle

source: Disposition
ca_es: Disposició
es_es: Disposición
pt_br: Disposição

source: Flow
ca_es: Flux
es_es: Flujo
pt_br: Fluxo

source: Condition
ca_es: Condició
es_es: Condición
pt_br: Condição

source: Numbers
ca_es: Nombres
es_es: Números
pt_br: Números

source: Time
ca_es: Temps
es_es: Tiempo
pt_br: Tempo

source: Others
ca_es: Altres
es_es: Otros
pt_br: Outros

source: Procedures
ca_es: Procediments
es_es: Procedimientos
pt_br: Procedimentos

source: What kind of comparison?
ca_es: Tipus de comparació?
es_es: ¿Tipo de comparación?
pt_br: Qual tipo de comparação?

source: Equal ( = )
ca_es: Igualtat ( = )
es_es: Igualdad ( = )
pt_br: Igualdade ( = )

source: Less ( < )
ca_es: Menor ( < )
es_es: Menor ( < )
pt_br: Menor ( < )

source: More ( > )
ca_es: Major ( > )
es_es: Mayor ( > )
pt_br: Maior ( > )

source: _Exit
ca_es: _Tanca
es_es: _Salir
pt_br: _Sair

source: What is the name of this procedure?
ca_es: Quin és el nom d'aquest procediment?
es_es: ¿Cúal es el nombre de este procedimiento?
pt_br: Qual é o nome deste procedimento?

source: Start
ca_es: Inici
es_es: Inicio
pt_br: Início

source: ON
ca_es: ENGEGA
es_es: ENCIENDE
pt_br: LIG

source: Which engines should be turned on?
pt_br: Quais motores devem ser ligados?

source: OFF
ca_es: ATURA
es_es: APAGA
pt_br: DESL

source: Which motors should be turned off?
ca_es: Quins motors s'han d'aturar?
es_es: ¿Qué motores se han de apagar?
pt_br: Quais motores devem ser desligados?

source: BRAKE
ca_es: FRENA
es_es: FRENA
pt_br: FREAR

source: Which motors should be braked?
ca_es: Quins motors s'han de frenar?
es_es: ¿Qué motores se han de frenar?
pt_br: Quais motores devem ser freados?

source: CW
ca_es: SH
es_es: SH
pt_br: PrCá

source: Which engines should turn clockwise?
pt_br: Quais motores devem girar em sentido horário?

source: antiCW
ca_es: SAH
es_es: SAH
pt_br: PrLá

source: Which engines should turn anticlockwise?
pt_br: Que motores devem girar em sentido anti-horário?

source: Which engines should be reversed?
pt_br: Inverter o sentido de que motores?

source: ONfor
ca_es: ENGper
es_es: ENCpor
pt_br: LIGp

source: Which engines should be turned on for a while?
pt_br: Quais motores devem ser acionados por um tempo?

source: POW
ca_es: POT
es_es: POT
pt_br: POT

source: Change power of which engines?
pt_br: Alterar potência de quais motores?

source: switch
ca_es: botó
es_es: botón
pt_br: botão

source: Insert the number
ca_es: Insertar número
es_es: Insertar número
pt_br: Digite o número

source: Insert time delay (tenths of second)
ca_es: Insertar temps retard (Décimes de segon)
es_es: Insertar tiempo retardo (Décimas de segundo)
pt_br: Digite o tempo (Décimos de segundo)

source: _Tools
pt_br: Ferramentas

source: Open _Monitor
pt_br: Abrir _Monitor

source: There are unsaved alterations in your project, press OK to close without saving, Save to save and close, or Cancel.
pt_br: Existem alterações no seu projeto que ainda não foram salvas, pressionde OK para sair sem salvar, Savar para salvar e sair ou Cancelar.

source: Choose timer:
pt_br: Escolha o timer:

source: Timer in ms, max time : 1 minute
pt_br: Timer em ms, tempo máximo: 1 minuto

source: Timer in ds, max time : 100 minute
pt_br: Timer em ds, tempo máximo: 100 minutos

source: There was a problem with the connection Verify that the board is properly connected with your computer
ca_es: Ha hagut un problema amb la connexió Verifiqueu correcta connexió de la targeta amb l'ordinador
es_es: Ha habido un problema con la conexión Verifique la correcta conexión de la tarjeta con el ordenador
pt_br: Houve um problema com a conexão Verifique se a placa está corretamente conectada com o seu computador

source: GoGo connected on:
pt_br: GoGo conectada em:

source: _View
ca_es: _Visualitza
es_es: _Ver
pt_br: _Ver

source: V_iew generated code
ca_es: M_ostra codi generat
es_es: V_er código generado
pt_br: V_er código gerado

source: Board Monitor
pt_br: Monitor da Placa

source: Text Mode
pt_br: Modo Texto

source: Data Upload
pt_br: Carregar Dados

source: Motors
pt_br: Motores

source: Select:
pt_br: Selecionar:

source: <b>Control:</b>
pt_br: <b>Controle:</b>

source: On
pt_br: Ligar

source: Off
pt_br: Desligar

source: Stop
pt_br: Parar

source: <b>Power:</b>
pt_br: <b>Potência:</b>

source: Set
pt_br: Definir

source: <b>Motor Direction:</b>
pt_br: <b>Direção do Motor:</b>

source: This way
pt_br: Para cá

source: That way
pt_br: Para lá

source: Reverse
pt_br: Inverter

source: Default
pt_br: Padrão

source: Servo Motors
pt_br: Servomotores

source: <b>Sensors</b>
pt_br: <b>Sensores</b>

source: Burst mode
pt_br: Modo rajada

source: Fast
pt_br: Rápido

source: Slow
pt_br: Lento

source: Refresh All
pt_br: Atualizar

source: Update Rate
pt_br: Taxa de atualização

source: <b>Other</b>
pt_br: <b>Outro</b>

source: Beep
pt_br: Bipe

source: LED On
pt_br: Ligar LED

source: LED Off
pt_br: Desligar LED

source: <b>Upload</b>
pt_br: <b>Carregar</b>

source: Start:
pt_br: Iniciar:

source: Automatic
pt_br: Automático

source: Specify Upload Length:
pt_br: Especificar quantidade de dados a serem carregados

source: Blocks:
pt_br: Blocos:

source: (1 block = 16 values)
pt_br: (1 bloco = 16 valores)

source: <b>Recorded Data</b>
pt_br: <b>Dados gravados</b>

source: Table
pt_br: Tabela

source: Graph
pt_br: Gráfico

source: Columns:
pt_br: Colunas:

source: Headers:
pt_br: Cabeçalhos:

source: Show
pt_br: Mostrar

source: 2 Lines
pt_br: 2 Linhas

source: Clear
pt_br: Limpar

source: Save
pt_br: Salvar

source: 0 Values
pt_br: 0 Valores

source: Sensor Lab
pt_br: Laboratório de Sensor

source: <b>Sensor Types</b> (can be used in the Console and Data Upload tabs)
pt_br: <b>Tipos de Sensor</b> (pode ser usado nas abas Console e Carregar Dados)

source: Add
pt_br: Adicionar

source: Remove
pt_br: Remover

source: Import
pt_br: Importar

source: Export
pt_br: Exportar

source: Export CSV
pt_br: Exportar CSV

source: <b>Sensor Points: </b>Name (Units)
pt_br: <b>Pontos do Sensor: </b>Nome (Unidades)

source: Description
pt_br: Descrição

source: Insert Point
pt_br: Inserir Ponto

source: Remove Point
pt_br: Remover Ponto

source: GoGo Value
pt_br: Valor da GoGo

source: Real Value
pt_br: Valor Real

source: Minimum:
pt_br: Mínimo:

source: Maximum:
pt_br: Máximo:

source: Define Step
pt_br: Definir Passo

source: Choose between 0 and 255
pt_br: Escolha um valor entre 0 e 255

source: Data successfully uploaded.
pt_br: Código enviado com sucesso.

source: Check GoGo plugged in, turned on and connected
pt_br: Verifique se a GoGo está conectada e ligada

source: Error communicating
pt_br: Erro comunicando

source: Save As..
pt_br: Salvar...

source: Name
pt_br: Nome

source: Unit
pt_br: Unidade

source: Standard
pt_br: Padrão

source: Error: unrecognised file type: %s. Use *.csv or *.sensor files.
pt_br: Erro: tipo de arquivo não reconhecido: %s. Use arquivos *.csv ou *.sensor

source: Error: Select sensor.
pt_br: Erro: Selecione um sensor.

source: None
pt_br: Nada

source: Raw values
pt_br: Valores Real

source: Open..
pt_br: Abrir...

source: At least two points required!
pt_br: Ao menos dois pontos são necessários!

source: %i Values Uploaded
pt_br: %i Valores Carregados

source: Compile
pt_br: Compilar

source: Get From Blocks
pt_br: Carregar do Blocos

source: Download
pt_br: Baixar Programa

source: The procedures will be overwritten, are you sure you want to proceed?
pt_br: Os procedimentos serão sobrescritos, deseja continuar?

source: Could not open file: %s
pt_br: Não é possível abrir o arquivo: %s

source: Loading %s
pt_br: Carregando %s

source: Save File...
pt_br: Salvar Arquivo...

source: Overwrite?
pt_br: Sobrescrever?

source: This file already exists. Want to overwrite?
pt_br: Este arquivo já existe. Deseja sobrescrevê-lo?

source: Save?
pt_br: Salvar?

source: Do you want to save the changes you have made?
pt_br: Deseja salvar as alterações que você fez?

source: Logo Procedures Editor
pt_br: Editor de Procedimentos Logo

source: Open File...
pt_br: Abrir Arquivo...

source: Saving %s
pt_br: Salvando %s

source: Could not save file: %s
pt_br: Não é possível salvar o arquivo: %s

source: File:
pt_br: Arquivo:

source: File: %s
pt_br: Arquivo: %s

source: The file may not have dot
pt_br: O arquivo não deve conter ponto final

source: Undefined function or variable being used
ca_es: Funció o variable indefinida usada
es_es: Función o variable indefinida usada

source: Code block too long
ca_es: Bloc de codi massa llarg
es_es: Bloque de código demasiado largo

source: Code too long
ca_es: Codi massa llarg
es_es: Código demasiado largo

source: board connection lost
ca_es: Connexió amb targeta perduda
es_es: Conexión con la tarjeta perdida

source: Some connections are missing in selected blocks
ca_es: Falten connexions als blocs seleccionats
es_es: Faltan conexiones a los bloques seleccionados

source: Set Variable block only accepts variables
ca_es: El bloc Canviar Variable només accepta variables
es_es: El bloque Cambiar Variable sólo acepta variables

source: File %s will be overwritten, are you sure you want to proceed?
ca_es: Fitxer %s se sobrescriurà, desitja continuar?
es_es: Fichero %s se sobrescribirá. ¿Desea continuar?

source: Which motors should be turned on?
ca_es: Quins motors s'han d'engegar?
es_es: ¿Qué motores se han de encender?

source: Which motors should turn clockwise?
ca_es: Quins motors han de girar en sentit horari?
es_es: ¿Qué motores han de girar en sentido horario?

source: Which motors should turn anticlockwise?
ca_es: Quins motors han de girar en sentit anti-horari?
es_es: ¿Qué motores han de girar en sentido antihorario?

source: REV
ca_es: INV
es_es: INV

source: Which motors should be reversed?
ca_es: Invertir el sentit de quins motors?
es_es: ¿Qué motores han de invertir el sentido de giro?

source: Which motors should be turned on for a while?
ca_es: Quins motors s'han d'engegar per un temps?
es_es: ¿Qué motores han de girar por un tiempo?

source: Change power of which motors?
ca_es: Canviar potència de quins motors?
es_es: ¿Cambiar potencia de qué motores?

source: Change position of which motors?
ca_es: Canviar posició de quins motors?
es_es: ¿Cambiar posición de qué motores?
